Amiya200/stm32_water_tank/Core/Src/screen.c
#include "screen.h"
#include "lcd_i2c.h"
#include "switches.h"
#include "model_handle.h"
#include "adc.h"
#include "rtc_i2c.h"
#include "acs712.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>
#include <stdint.h>
#include "stm32f1xx_hal.h"

typedef enum {
    UI_WELCOME = 0,
    UI_DASH,
    UI_MENU,
    UI_TIMER_SLOT_SELECT,
    UI_TIMER_EDIT_ON_TIME,
    UI_TIMER_EDIT_OFF_TIME,
    UI_TIMER_EDIT_DAYS,
    UI_TIMER_EDIT_GAP,
    UI_TIMER_EDIT_ENABLE,
    UI_TIMER_EDIT_SUMMARY,
    UI_AUTO_MENU,
    UI_AUTO_EDIT_GAP,
    UI_AUTO_EDIT_MAXRUN,
    UI_AUTO_EDIT_RETRY,
    UI_SEMI_AUTO,
    UI_TWIST,
    UI_TWIST_EDIT_ON,
    UI_TWIST_EDIT_OFF,
    UI_TWIST_EDIT_ON_H,
    UI_TWIST_EDIT_ON_M,
    UI_TWIST_EDIT_OFF_H,
    UI_TWIST_EDIT_OFF_M,
    UI_COUNTDOWN,
    UI_COUNTDOWN_EDIT_MIN,
    UI_DEVSET_MENU,
    UI_SETTINGS_GAP,
    UI_SETTINGS_RETRY,
    UI_SETTINGS_UV,
    UI_SETTINGS_OV,
    UI_SETTINGS_OL,
    UI_SETTINGS_UL,
    UI_SETTINGS_MAXRUN,
    UI_SETTINGS_PWRREST,
    UI_SETTINGS_FACTORY,
    UI_DEVSET_EDIT_DATE,
    UI_DEVSET_EDIT_TIME,
    UI_DEVSET_EDIT_DAY,
    UI_ADD_DEVICE_MENU,
    UI_ADD_DEVICE_PAIR,
    UI_ADD_DEVICE_REMOVE,
    UI_ADD_DEVICE_PAIR_DONE,
    UI_ADD_DEVICE_REMOVE_DONE,
    UI_RESET_CONFIRM,
    UI_NONE,
    UI_MAX_
} UiState;

typedef enum {
    BTN_NONE = 0,
    BTN_RESET,
    BTN_SELECT,
    BTN_UP,
    BTN_DOWN,
    BTN_RESET_LONG,
    BTN_SELECT_LONG,
    BTN_UP_LONG,
    BTN_DOWN_LONG
} UiButton;
static UiState ui      = UI_WELCOME;
static UiState last_ui = UI_NONE;
static bool screenNeedsRefresh = false;
static uint32_t lastLcdUpdateTime  = 0;
static uint32_t lastUserAction     = 0;
extern void ModelHandle_StartAuto(uint16_t gap_s, uint16_t maxrun_min, uint8_t retry);
extern void ModelHandle_StartTimerNearestSlot(void);
extern void ModelHandle_StopTimer(void);
extern void ModelHandle_StopSemiAuto(void);
extern void ModelHandle_FactoryReset(void);
#define WELCOME_MS         2500
#define CURSOR_BLINK_MS     400
#define AUTO_BACK_MS      60000
#define LONG_PRESS_MS      3000
#define CONTINUOUS_STEP_MS  250
#define DASH_PAGE0_TIME   4500UL
#define DASH_PAGE1_TIME   150UL
#define DRY_BLINK_MS       400UL
static bool reset_confirm_yes = false;
extern ADC_Data adcData;
extern TimerSlot timerSlots[5];
extern TwistSettings twistSettings;
extern RTC_Time_t time;
extern volatile bool manualActive;
extern volatile bool semiAutoActive;
extern volatile bool timerActive;
extern volatile bool countdownActive;
extern volatile bool twistActive;
extern volatile bool autoActive;
extern volatile uint32_t countdownDuration;
static uint8_t edit_on_h = 0;
static uint8_t edit_on_m = 0;
static uint8_t edit_off_h = 0;
static uint8_t edit_off_m = 0;
static uint8_t time_edit_field = 0;
static uint8_t edit_day_mask = 0x7F;
static uint8_t edit_day_index = 0;
static uint8_t edit_gap_min = 0;
static bool edit_slot_enabled = true;
static uint8_t currentSlot = 0;
static uint8_t timer_page = 0;
static uint16_t edit_auto_gap_s      = 60;
static uint16_t edit_auto_maxrun_min = 120;
static uint16_t edit_auto_retry      = 0;
static uint16_t edit_twist_on_s  = 5;
static uint16_t edit_twist_off_s = 5;
static uint8_t edit_twist_on_hh  = 6;
static uint8_t edit_twist_on_mm  = 0;
static uint8_t edit_twist_off_hh = 18;
static uint8_t edit_twist_off_mm = 0;
static uint16_t edit_countdown_min = 1;
static uint16_t edit_settings_gap_s = 10;
static uint8_t  edit_settings_retry = 3;
static uint16_t edit_settings_uv    = 180;
static uint16_t edit_settings_ov    = 260;
static int edit_settings_ol = 6;
static int edit_settings_ul = 0;
static uint16_t edit_settings_maxrun = 120;
static uint8_t  edit_settings_pwrrest = 0;
static bool     edit_settings_factory_yes = false;
static uint8_t  edit_settings_dry_en = 1;
static uint8_t  edit_date_dd    = 1;
static uint8_t  edit_date_mm    = 1;
static uint16_t edit_date_yyyy  = 2025;
static uint8_t  edit_date_field = 0;
static uint8_t  edit_time_hh    = 0;
static uint8_t  edit_time_min   = 0;
static uint8_t  edit_time_field = 0;
static uint8_t  edit_day_idx2   = 0;
static const char* const dowNames[7] = {
    "Sun","Mon","Tue","Wed","Thu","Fri","Sat"
};
static uint8_t addDevMenuIndex  = 0;
static uint8_t addDevTypeIndex  = 0;
static uint8_t lastAddDevType   = 0;
extern uint8_t ModelHandle_GetTankLevelPercent(void);
extern bool ModelHandle_IsTankFull(void);
extern DryFSMState ModelHandle_GetDryState(void);
extern bool ModelHandle_GetDryRunEnable(void);
extern uint16_t ModelHandle_GetDryRunRetryGap(void);
static const char* const addDevTypeNames[] = {
    "Wi-Fi",
    "Receiver",
    "Transmitter"
};
static const char* const main_menu[] = {
    "Add New Device",
    "Device Setup",
    "Reset To Default"
};
#define MAIN_MENU_COUNT 3
static uint8_t menu_idx      = 0;
static uint8_t menu_view_top = 0;
static const char* const devset_menu_items[] = {
    "Dry Run En",
    "Test Time",
    "Retry Gap",
    "Low Volt",
    "High Volt",
    "Over Load",
    "Under Load",
    "Max Run",
    "Set Date",
    "Set Time",
    "Set Day",
    "Power Restore",
    "Factory Reset",
    "Back"
};
#define DEVSET_MENU_COUNT  (sizeof(devset_menu_items)/sizeof(devset_menu_items[0]))
#define DEBOUNCE_MS        50
#define REPEAT_START_MS    500
#define REPEAT_INTERVAL_MS 150
static uint8_t devset_idx      = 0;
static uint8_t devset_view_top = 0;
static uint8_t  dash_page        = 0;
static uint32_t dash_cycle_start = 0;
static uint8_t  dry_blink_slot   = 0;
static uint32_t dry_blink_start  = 0;
void Screen_Init(void)
{
    lcd_init();
    lcd_clear();
    ui = UI_WELCOME;
    last_ui = UI_NONE;
    screenNeedsRefresh = true;
    lastUserAction = HAL_GetTick();
}

static inline void refreshInactivityTimer(void)
{
    lastUserAction = HAL_GetTick();
}

static inline void lcd_line(uint8_t row, const char* s)
{
    char buf[17];
    snprintf(buf, sizeof(buf), "%-16.16s", s);
    lcd_put_cur(row, 0);
    lcd_send_string(buf);
}

static inline void lcd_line0(const char* s){ lcd_line(0,s); }
static inline void lcd_line1(const char* s){ lcd_line(1,s); }

