Amiya200/stm32_water_tank/Core/Src/screen.c
static void show_welcome(void)
{
    lcd_line0("   HELONIX");
    lcd_line1(" IntelligentSys");
}

static void show_dash(void)
{
    char l0[17], l1[17];
    uint32_t now = HAL_GetTick();
    if (dash_cycle_start == 0)
        dash_cycle_start = now;
    uint32_t elapsed = now - dash_cycle_start;
    uint8_t  new_page;
    if      (elapsed < DASH_PAGE0_TIME)                      new_page = 0;
    else if (elapsed < (DASH_PAGE0_TIME + DASH_PAGE1_TIME))  new_page = 1;
    else  { dash_cycle_start = now; new_page = 0; }
    if (new_page != dash_page)
    {
        dash_page          = new_page;
        screenNeedsRefresh = true;
        dry_blink_slot     = 0;
        dry_blink_start    = now;
        return;
    }
    uint8_t     tankPercent    = ModelHandle_GetTankLevelPercent();
    bool        tankFull       = ModelHandle_IsTankFull();
    bool        motorOn        = Motor_GetStatus();
    DryFSMState dryState       = ModelHandle_GetDryState();
    bool        dryEnabled     = ModelHandle_GetDryRunEnable();
    bool        sensorHasWater = ModelHandle_IsDryRunActive(); /* TRUE = water present */
    const char *gw             = (adcData.voltages[4] <= 0.01f) ? "YES" : "NO ";
    const char *mode;
    if      (ModelHandle_IsRestartActive()) mode = "Refill ";
    else if (ModelHandle_IsVoltageFault())  mode = "VOLTERR";
    else if (ModelHandle_IsOverload())      mode = "OVERLD ";
    else if (ModelHandle_IsUnderload())     mode = "UNDERLD";
    else if (timerActive)                   mode = "TIMER  ";
    else if (autoActive)      mode = motorOn ? "AUTO   " : "AUTO WT";
    else if (countdownActive) mode = motorOn ? "COUNT  " : "CD WAIT";
    else if (twistActive)     mode = motorOn ? "TWIST  " : "TWIST W";
    else if (semiAutoActive)  mode = motorOn ? "SEMI   " : "SEMI OF";
    else if (manualActive)    mode = "MANUAL ";
    else if (tankFull)        mode = "FULL   ";
    else                      mode = "READY  ";

    if (dash_page == 0)
    {
        snprintf(l0, sizeof(l0), "%-7sM:%-3s%3d%%",
                 mode, motorOn ? "ON " : "OFF", tankPercent);
        if ((now - dry_blink_start) >= DRY_BLINK_MS)
        {
            dry_blink_slot  = dry_blink_slot ? 0 : 1;
            dry_blink_start = now;
        }
        bool dryVisible = (dry_blink_slot == 0);
        if (dryState == DRY_FAULT)
        {
            if (dryVisible)
                snprintf(l1, sizeof(l1), "G.W:%-3s DRY%02u:%02u",
                         gw, time.hour, time.min);
            else
                snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u",
                         gw, time.hour, time.min);
        }
        else if (tankFull)
        {
            snprintf(l1, sizeof(l1), "TANK FULL %02u:%02u",
                     time.hour, time.min);
        }
        else if (dryEnabled && motorOn && !sensorHasWater)
        {
            if (dryVisible)
                snprintf(l1, sizeof(l1), "G.W:%-3s DRY%02u:%02u",
                         gw, time.hour, time.min);
            else
                snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u",
                         gw, time.hour, time.min);
        }
        else if (dryEnabled)
        {
            snprintf(l1, sizeof(l1), "G.W:%-3s DRY%02u:%02u",
                     gw, time.hour, time.min);
        }
        else
        {
            snprintf(l1, sizeof(l1), "G.W:%-3s    %02u:%02u",
                     gw, time.hour, time.min);
        }

        lcd_line0(l0);
        lcd_line1(l1);
    }
    else
    {
        const char *dow = "---";
        if (time.dow >= 1 && time.dow <= 7)
            dow = dowNames[(time.dow - 1) % 7];

        snprintf(l1, sizeof(l0), "%-12.12s", dow);
        snprintf(l0, sizeof(l1), "%02u:%02u %3.0fV %4.1fA",
                 time.hour, time.min, g_voltageV, g_currentA);

        lcd_line0(l0);
        lcd_line1(l1);
    }
}


static void draw_menu_cursor(void)
{
    if (ui != UI_MENU) return;
    uint8_t row = 255;
    if      (menu_idx == menu_view_top)     row = 0;
    else if (menu_idx == menu_view_top + 1) row = 1;
    if (row <= 1)
    {
        lcd_put_cur(row, 0);
        lcd_send_data('>');
    }
}

static void show_menu(void)
{
    char l0[17], l1[17];
    if (menu_idx < menu_view_top)
        menu_view_top = menu_idx;
    else if (menu_idx > menu_view_top + 1)
        menu_view_top = menu_idx - 1;

    snprintf(l0, sizeof(l0), " %-15.15s", main_menu[menu_view_top]);
    if (menu_view_top + 1 < MAIN_MENU_COUNT)
        snprintf(l1, sizeof(l1), " %-15.15s", main_menu[menu_view_top + 1]);
    else
        snprintf(l1, sizeof(l1), "                ");

    lcd_line0(l0);
    lcd_line1(l1);
    draw_menu_cursor();
}

static void show_devset_menu(void)
{
    char l0[17], l1[17];
    if (devset_idx < devset_view_top)
        devset_view_top = devset_idx;
    else if (devset_idx > devset_view_top + 1)
        devset_view_top = devset_idx - 1;

    uint8_t idx0 = devset_view_top;
    uint8_t idx1 = devset_view_top + 1;

    char star0 = ' ', star1 = ' ';

    for (int pass = 0; pass < 2; pass++)
    {
        uint8_t idx  = (pass == 0) ? idx0 : idx1;
        char   *star = (pass == 0) ? &star0 : &star1;
        switch (idx)
        {
            case 0:  if (edit_settings_dry_en)           *star = '*'; break;
            case 1:  if (edit_settings_gap_s > 0)        *star = '*'; break;
            case 2:  if (edit_settings_retry > 0)        *star = '*'; break;
            case 3:  if (edit_settings_uv > 0)           *star = '*'; break;
            case 4:  if (edit_settings_ov > 0)           *star = '*'; break;
            case 5:  if (edit_settings_ol > 0)           *star = '*'; break;
            case 6:  if (edit_settings_ul > 0)           *star = '*'; break;
            case 7:  if (edit_settings_maxrun > 0)       *star = '*'; break;
            default: break;
        }
    }

    if (idx0 < DEVSET_MENU_COUNT)
        snprintf(l0, sizeof(l0), "%c%c%-14.14s",
                 (devset_idx == idx0 ? '>' : ' '), star0, devset_menu_items[idx0]);
    else
        snprintf(l0, sizeof(l0), "                ");

    if (idx1 < DEVSET_MENU_COUNT)
        snprintf(l1, sizeof(l1), "%c%c%-14.14s",
                 (devset_idx == idx1 ? '>' : ' '), star1, devset_menu_items[idx1]);
    else
        snprintf(l1, sizeof(l1), "                ");

