Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui == UI_DEVSET_MENU)
    {
        switch (devset_idx)
        {
            case 0:
                edit_settings_dry_en ^= 1;
                apply_settings_core();
                break;
            case 1:
                edit_settings_gap_s = (edit_settings_gap_s > 0) ? 0 : 5;
                apply_settings_core();
                break;
            case 2:
                edit_settings_retry = (edit_settings_retry > 0) ? 0 : 5;
                apply_settings_core();
                break;
            case 3:
                edit_settings_uv = (edit_settings_uv > 0) ? 0 : 180;
                apply_settings_core();
                break;
            case 4:
                edit_settings_ov = (edit_settings_ov > 0) ? 0 : 260;
                apply_settings_core();
                break;
            case 5:
                edit_settings_ol = (edit_settings_ol > 0) ? 0 : 6;
                apply_settings_core();
                break;
            case 6:
                edit_settings_ul = (edit_settings_ul > 0) ? 0 : 2;
                apply_settings_core();
                break;
            case 7:
                edit_settings_maxrun = (edit_settings_maxrun > 0) ? 0 : 60;
                apply_settings_core();
                break;
            case 8:  ui = UI_DEVSET_EDIT_DATE; break;
            case 9:  ui = UI_DEVSET_EDIT_TIME; break;
            case 10: ui = UI_DEVSET_EDIT_DAY;  break;
            case 11:
                edit_settings_pwrrest = (edit_settings_pwrrest + 1) % 3;
                ModelHandle_SetPowerRestoreMode(edit_settings_pwrrest);
                break;
            case 12:
                edit_settings_factory_yes ^= 1;
                if (edit_settings_factory_yes)
                {
                    ModelHandle_FactoryReset();
                    edit_settings_dry_en  = ModelHandle_GetDryRunEnable() ? 1 : 0;
                    edit_settings_gap_s   = ModelHandle_GetGapTime() / 60;
                    edit_settings_retry   = ModelHandle_GetDryRunRetryGap() / 60;
                    edit_settings_uv      = ModelHandle_GetUnderVolt();
                    edit_settings_ov      = ModelHandle_GetOverVolt();
                    edit_settings_maxrun  = ModelHandle_GetMaxRunTime();
                    edit_settings_ol      = (int)ModelHandle_GetOverloadLimit();
                    edit_settings_ul      = (int)ModelHandle_GetUnderloadLimit();
                    edit_settings_pwrrest = ModelHandle_GetPowerRestoreMode();
                    edit_settings_factory_yes = false;
                    ui = UI_DASH;
                }
                break;
            case 13:
                ui = UI_MENU;
                break;
        }
        screenNeedsRefresh = true;
        return;
    }

    if (ui == UI_DEVSET_EDIT_DATE)
    {
        if (edit_date_field < 2)
            edit_date_field++;
        else
        {
            time.dom   = edit_date_dd;
            time.month = edit_date_mm;
            time.year  = edit_date_yyyy;
            RTC_SetTimeDate(time.sec, time.min, time.hour,
                            time.dow, time.dom, time.month, time.year);
            ui = UI_DEVSET_MENU;
        }
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_DEVSET_EDIT_TIME)
    {
        if (edit_time_field == 0)
            edit_time_field = 1;
        else
        {
            time.hour = edit_time_hh;
            time.min  = edit_time_min;
            time.sec  = 0;
            RTC_SetTimeDate(time.sec, time.min, time.hour,
                            time.dow, time.dom, time.month, time.year);
            ui = UI_DEVSET_MENU;
        }
        screenNeedsRefresh = true;
        return;
    }
    if (ui == UI_DEVSET_EDIT_DAY)
    {
        time.dow = edit_day_idx2 + 1;
        RTC_SetTimeDate(time.sec, time.min, time.hour,
                        time.dow, time.dom, time.month, time.year);
        ui = UI_DEVSET_MENU;
        screenNeedsRefresh = true;
        return;
    }
}

void increase_edit_value(uint8_t step)
{
    switch (ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) { edit_on_h += step; if (edit_on_h > 23) edit_on_h = 23; }
            else { edit_on_m += step; if (edit_on_m > 59) edit_on_m = 59; }
            break;
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) { edit_off_h += step; if (edit_off_h > 23) edit_off_h = 23; }
            else { edit_off_m += step; if (edit_off_m > 59) edit_off_m = 59; }
            break;
        case UI_TIMER_EDIT_GAP:
            edit_gap_min += step;
            if (edit_gap_min > 240) edit_gap_min = 240;
            break;
        case UI_AUTO_EDIT_GAP:     edit_auto_gap_s += step; break;
        case UI_AUTO_EDIT_MAXRUN:  edit_auto_maxrun_min += step; break;
        case UI_AUTO_EDIT_RETRY:   edit_auto_retry += step; break;
        case UI_TWIST_EDIT_ON:     edit_twist_on_s += step; break;
        case UI_TWIST_EDIT_OFF:    edit_twist_off_s += step; break;
        case UI_TWIST_EDIT_ON_H:
            edit_twist_on_hh += step;
            if (edit_twist_on_hh > 23) edit_twist_on_hh = 23;
            break;
        case UI_TWIST_EDIT_ON_M:
            edit_twist_on_mm += step;
            if (edit_twist_on_mm > 59) edit_twist_on_mm = 59;
            break;
        case UI_TWIST_EDIT_OFF_H:
            edit_twist_off_hh += step;
            if (edit_twist_off_hh > 23) edit_twist_off_hh = 23;
            break;
        case UI_TWIST_EDIT_OFF_M:
            edit_twist_off_mm += step;
            if (edit_twist_off_mm > 59) edit_twist_off_mm = 59;
            break;
        case UI_COUNTDOWN_EDIT_MIN:
            if (edit_countdown_min < 180) edit_countdown_min += 1;
            if (edit_countdown_min > 180) edit_countdown_min = 180;
            break;
        case UI_SETTINGS_GAP:
            edit_settings_gap_s += step;
            if (edit_settings_gap_s > 15) edit_settings_gap_s = 15;
            break;
        case UI_SETTINGS_RETRY:
            edit_settings_retry += step;
            if (edit_settings_retry > 180) edit_settings_retry = 180;
            break;
        case UI_SETTINGS_UV:
            if (edit_settings_uv == 0) edit_settings_uv = 150;
            else { edit_settings_uv += step; if (edit_settings_uv > 200) edit_settings_uv = 200; }
            break;
        case UI_SETTINGS_OV:
            if (edit_settings_ov == 0) edit_settings_ov = 250;
            else { edit_settings_ov += step; if (edit_settings_ov > 300) edit_settings_ov = 300; }
            break;
        case UI_SETTINGS_OL:
            edit_settings_ol += step;
            if (edit_settings_ol > 25) edit_settings_ol = 25;
            break;
        case UI_SETTINGS_UL:
            edit_settings_ul += step;
            if (edit_settings_ul > 10) edit_settings_ul = 10;
            break;
        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun == 0) edit_settings_maxrun = 10;
            else { edit_settings_maxrun += step; if (edit_settings_maxrun > 300) edit_settings_maxrun = 300; }
            break;
        case UI_SETTINGS_PWRREST:
            edit_settings_pwrrest = (edit_settings_pwrrest + 1) % 3;
            break;
        case UI_SETTINGS_FACTORY:
            edit_settings_factory_yes ^= 1;
            break;
        case UI_DEVSET_EDIT_DATE:
            if      (edit_date_field == 0) { edit_date_dd += step; if (edit_date_dd > 31) edit_date_dd = 31; }
            else if (edit_date_field == 1) { edit_date_mm += step; if (edit_date_mm > 12) edit_date_mm = 12; }
            else { edit_date_yyyy += step; if (edit_date_yyyy > 2099) edit_date_yyyy = 2099; }
            break;
        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) { edit_time_hh += step; if (edit_time_hh > 23) edit_time_hh = 23; }
            else { edit_time_min += step; if (edit_time_min > 59) edit_time_min = 59; }
            break;
        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 1) % 7);
            break;
        default:
            break;
    }
}

void decrease_edit_value(uint8_t step)
{
    switch (ui)
    {
        case UI_TIMER_EDIT_ON_TIME:
            if (time_edit_field == 0) { if (edit_on_h > step) edit_on_h -= step; else edit_on_h = 0; }
            else { if (edit_on_m > step) edit_on_m -= step; else edit_on_m = 0; }
            break;
        case UI_TIMER_EDIT_OFF_TIME:
            if (time_edit_field == 0) { if (edit_off_h > step) edit_off_h -= step; else edit_off_h = 0; }
            else { if (edit_off_m > step) edit_off_m -= step; else edit_off_m = 0; }
            break;
        case UI_TIMER_EDIT_GAP:
            if (edit_gap_min > step) edit_gap_min -= step; else edit_gap_min = 0;
            break;
        case UI_AUTO_EDIT_GAP:
            if (edit_auto_gap_s > step) edit_auto_gap_s -= step; else edit_auto_gap_s = 0;
            break;
        case UI_AUTO_EDIT_MAXRUN:
            if (edit_auto_maxrun_min > step) edit_auto_maxrun_min -= step; else edit_auto_maxrun_min = 0;
            break;
        case UI_AUTO_EDIT_RETRY:
            if (edit_auto_retry > step) edit_auto_retry -= step; else edit_auto_retry = 0;
            break;
        case UI_SETTINGS_GAP:
            if (edit_settings_gap_s > step) edit_settings_gap_s -= step; else edit_settings_gap_s = 0;
            break;
        case UI_SETTINGS_RETRY:
            if (edit_settings_retry > step) edit_settings_retry -= step; else edit_settings_retry = 0;
            break;
        case UI_SETTINGS_OL:
            if (edit_settings_ol > step) edit_settings_ol -= step; else edit_settings_ol = 0;
            break;
        case UI_SETTINGS_UL:
            if (edit_settings_ul > step) edit_settings_ul -= step; else edit_settings_ul = 0;
            break;
        case UI_SETTINGS_MAXRUN:
            if (edit_settings_maxrun > step) edit_settings_maxrun -= step; else edit_settings_maxrun = 0;
            break;
        case UI_DEVSET_EDIT_DATE:
            if      (edit_date_field == 0) { if (edit_date_dd > step) edit_date_dd -= step; else edit_date_dd = 1; }
            else if (edit_date_field == 1) { if (edit_date_mm > step) edit_date_mm -= step; else edit_date_mm = 1; }
            else { if (edit_date_yyyy > (2000 + step)) edit_date_yyyy -= step; else edit_date_yyyy = 2000; }
            break;
        case UI_DEVSET_EDIT_TIME:
            if (edit_time_field == 0) { if (edit_time_hh > step) edit_time_hh -= step; else edit_time_hh = 0; }
            else { if (edit_time_min > step) edit_time_min -= step; else edit_time_min = 0; }
            break;
        case UI_DEVSET_EDIT_DAY:
            edit_day_idx2 = (uint8_t)((edit_day_idx2 + 6) % 7);
            break;
        default:
            break;
    }
}

static UiButton decode_button_press(void)
{
    static bool last_raw[4] = {0};
    static bool stable_state[4] = {0};
    static uint32_t last_change_time[4] = {0};
    static uint32_t press_time[4] = {0};
    static bool long_sent[4] = {0};
    static uint32_t last_repeat_time[4] = {0};
    uint32_t now = HAL_GetTick();
    UiButton result = BTN_NONE;
    for (int i = 0; i < 4; i++)
    {
        bool raw = Switch_IsPressed(i);
        if (raw != last_raw[i])
        {
            last_change_time[i] = now;
            last_raw[i] = raw;
        }
        if ((now - last_change_time[i]) > DEBOUNCE_MS)
        {
            if (stable_state[i] != raw)
            {
                stable_state[i] = raw;
                if (raw)
                {
                    press_time[i] = now;
                    long_sent[i]  = false;
                }
                else
                {
                    if (!long_sent[i])
                    {
                        switch (i)
                        {
                            case 0: result = BTN_RESET;  break;
                            case 1: result = BTN_SELECT; break;
                            case 2: result = BTN_UP;     break;
                            case 3: result = BTN_DOWN;   break;
                        }
                    }
                }
            }
        }
        if (stable_state[i] && !long_sent[i])
        {
            if ((now - press_time[i]) >= LONG_PRESS_MS)
            {
                long_sent[i] = true;
                last_repeat_time[i] = now;
                switch (i)
                {
                    case 0: result = BTN_RESET_LONG;  break;
                    case 1: result = BTN_SELECT_LONG; break;
                    case 2: result = BTN_UP_LONG;     break;
                    case 3: result = BTN_DOWN_LONG;   break;
                }
            }
        }
    }
    return result;
}

void Screen_HandleSwitches(void)
{
    UiButton b = decode_button_press();
    uint32_t now_sw = HAL_GetTick();
    {
        static uint32_t rep_start[2] = {0, 0};
        static uint32_t rep_last[2]  = {0, 0};

        bool in_menu = (ui != UI_DASH &&
                        ui != UI_WELCOME &&
                        ui != UI_COUNTDOWN &&
                        ui != UI_NONE);
        if (in_menu)
        {
            for (int ri = 0; ri < 2; ri++)
            {
                bool held = Switch_IsPressed(ri == 0 ? 2 : 3);
                if (held)
                {
                    if (rep_start[ri] == 0) rep_start[ri] = now_sw;

                    uint32_t held_ms = now_sw - rep_start[ri];
                    if (held_ms >= REPEAT_START_MS &&
                        (now_sw - rep_last[ri]) >= REPEAT_INTERVAL_MS)
                    {
                        rep_last[ri] = now_sw;
                        if (b == BTN_NONE)
                            b = (ri == 0) ? BTN_UP : BTN_DOWN;
                    }
                }
                else
                {
                    rep_start[ri] = 0;
                    rep_last[ri]  = 0;
                }
            }
        }
        else
        {
            rep_start[0] = rep_start[1] = 0;
            rep_last[0]  = rep_last[1]  = 0;
        }
    }
    if (b == BTN_NONE) return;
    refreshInactivityTimer();

