Amiya200/stm32_water_tank/Core/Src/screen.c
    if (ui >= UI_MAX_)
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Welcome → Dash transition */
    if (ui == UI_WELCOME && (now - lastLcdUpdateTime >= WELCOME_MS))
    {
        lastLcdUpdateTime = now;
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Auto-back to dash on inactivity (not from welcome/dash/countdown) */
    if (ui != UI_WELCOME &&
        ui != UI_DASH &&
        ui != UI_COUNTDOWN &&
        (now - lastUserAction >= AUTO_BACK_MS))
    {
        ui = UI_DASH;
        screenNeedsRefresh = true;
    }

    /* Countdown: refresh every second so timer counts down visibly */
    if ((ui == UI_COUNTDOWN) &&
        (now - lastLcdUpdateTime) >= 1000)
    {
        lastLcdUpdateTime = now;
        screenNeedsRefresh = true;
    }

    /* ---------------------------------------------------------------
     * Dashboard in-place refresh:
     *   – Page 0 is refreshed every DRY_BLINK_MS so the DRY text can
     *     blink without a full lcd_clear().  We call show_dash() which
     *     writes both lines in-place.  show_dash() itself will set
     *     screenNeedsRefresh=true and return early if the page needs
     *     to change (which triggers the full clear path below).
     *   – No refresh is needed while on page 1 (static content) except
     *     on entry.
     * --------------------------------------------------------------- */
    if (ui == UI_DASH && dash_page == 0 &&
        (now - dry_blink_start) >= DRY_BLINK_MS)
    {
        /* Update blink slot and rewrite lines in-place (no lcd_clear) */
        dry_blink_slot  = dry_blink_slot ? 0 : 1;
        dry_blink_start = now;
        show_dash();  /* writes lines directly; no clear */
        /* If show_dash() changed the page it already set screenNeedsRefresh */
    }

    /* Full redraw path: only when state changes or page switches */
    if (screenNeedsRefresh || ui != last_ui)
    {
        lcd_clear();
        last_ui = ui;
        screenNeedsRefresh = false;

        /* Reset blink state on every full redraw so blink starts cleanly */
        if (ui == UI_DASH)
        {
            dry_blink_slot  = 0;
            dry_blink_start = now;
        }

        switch (ui)
        {
            case UI_WELCOME:   show_welcome();   break;
            case UI_DASH:      show_dash();      break;
            case UI_MENU:      show_menu();      break;
            case UI_COUNTDOWN: show_countdown(); break;
            default: break;
        }
    }
}
